DataProcessors/ГрупповоеРедактированиеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеРедактированиеНачислений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/УчетНачисленийВСреднемЗаработкеОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УчетНачисленийВСреднемЗаработкеОбщий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийЗаработок</Name>
					<Comment>Общий заработок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияФиксированнойСуммой</Name>
					<Comment>Премия, учитываемая пропорционально отработанному времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияПроцентом</Name>
					<Comment>Премия, полностью учитываемая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяФиксированнойСуммой</Name>
					<Comment>Годовая премия, учитываемая пропорционально отработанному времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияГодоваяПроцентом</Name>
					<Comment>Годовая премия, полностью учитываемая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВключать</Name>
					<Comment>Не включать</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетаСреднегоЗаработкаОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетаСреднегоЗаработкаОбщий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постановление2010</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постановление100Отпускные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЕСВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыЕСВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяЗарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамГПХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГигКонтрактам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Больничные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декретные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленияМобилизованным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыполненияНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыВыполненияНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОтдельномуДокументуДоОкончательногоРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЗаданныхМесяцахПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗначениюПоказателяПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗначениюВидаВремениПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПраздничныеДниПриОкончательномРасчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ГрупповоеРедактированиеНачислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Функция ДобавитьКомандыПечати() Экспорт
	КомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
	
	// Облагаемая база НДФЛ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОблагаемаяБазаНДФЛ";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 10;
	КомандаПечати.Представление = НСтр("ru='Облагаемая база НДФЛ';uk='Оподатковувана база ПДФО'");
	
	// Состав среднего заработка (командировки, отпуска и др.).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СоставСреднегоЗаработкаОбщего";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 20;
	КомандаПечати.Представление = НСтр("ru='Состав среднего заработка (командировки, отпуска и др.)';uk='Склад середнього заробітку (відрядження, відпустки та ін.)'");
	
	// Расчетная база ЕСВ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РасчетнаяБазаСтраховыхВзносов";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 40;
	КомандаПечати.Представление = НСтр("ru='Расчетная база ЕСВ';uk='Розрахункова база ЄСВ'");
	
	
	// Состав ФОТ.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СоставФОТ";
	КомандаПечати.НеВыполнятьЗаписьВФорме = Истина;
	КомандаПечати.Порядок = 50;
	КомандаПечати.Представление = НСтр("ru='Состав ФОТ';uk='Склад ФОП'");
	
	Возврат КомандыПечати;
	
КонецФункции


// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ГрупповоеРедактированиеНачислений.ПФ_MXL_СписокНачислений");
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОблагаемаяБазаНДФЛ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ОблагаемаяБазаНДФЛ",
			НСтр("ru='Список начислений';uk='Список нарахувань'"),
			ПечатнаяФормаБазаНДФЛ(Макет, "ОблагаемаяБазаНДФЛ", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставСреднегоЗаработкаОбщего") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СоставСреднегоЗаработкаОбщего",
			НСтр("ru='Список начислений';uk='Список нарахувань'"),
			ПечатнаяФормаБазаСреднегоЗаработкаОбщего(Макет, "СоставСреднегоЗаработкаОбщего", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РасчетнаяБазаСтраховыхВзносов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
			"РасчетнаяБазаСтраховыхВзносов",
			НСтр("ru='Список начислений';uk='Список нарахувань'"),
			ПечатнаяФормаБазаСтраховыхВзносов(Макет, "РасчетнаяБазаСтраховыхВзносов", ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СоставФОТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СоставФОТ",
			НСтр("ru='Состав ФОТ';uk='Склад ФОП'"),
			ПечатнаяФормаСоставФОТ(Макет, "СоставФОТ", ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцедурыПечатиСписковНачислений

Функция ПечатнаяФормаБазаНДФЛ(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаКодДоходаНДФЛ = Макет.ПолучитьОбласть("Шапка|КодДоходаНДФЛ");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаКодДоходаНДФЛ = Макет.ПолучитьОбласть("СтрокаТаблицы|КодДоходаНДФЛ");
	
	ДанныеДляПечати = ОблагаемаяБазаНДФЛ();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru='Облагаемая база НДФЛ';uk='Оподатковувана база ПДФО'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаКодДоходаНДФЛ);
	
	Выборка = ДанныеДляПечати.ОблагаетсяНДФЛ.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаКодДоходаНДФЛ.Параметры.КодДоходаНДФЛ = Выборка.КодДоходаНДФЛСтрока;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаКодДоходаНДФЛ);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатнаяФормаБазаСреднегоЗаработкаОбщего(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьШапкаУчетНачислений = Макет.ПолучитьОбласть("Шапка|УчетНачислений");
	ОбластьШапкаИндексируется = Макет.ПолучитьОбласть("Шапка|Индексируется");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	ОбластьСтрокаУчетНачислений = Макет.ПолучитьОбласть("СтрокаТаблицы|УчетНачислений");
	ОбластьСтрокаИндексируется = Макет.ПолучитьОбласть("СтрокаТаблицы|Индексируется");
	
	ДанныеДляПечати = СоставСреднегоЗаработкаОбщего();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru='Состав среднего заработка (командировки, отпуска и др.)';uk='Склад середнього заробітку (відрядження, відпустки та ін.)'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	ТабДокумент.Присоединить(ОбластьШапкаУчетНачислений);
	ТабДокумент.Присоединить(ОбластьШапкаИндексируется);
	
	Выборка = ДанныеДляПечати.ВходитВСоставСреднегоЗаработка.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		ОбластьСтрокаУчетНачислений.Параметры.УчетНачислений = Выборка.УчетНачисленийВСреднемЗаработкеОбщий;
		ОбластьСтрокаИндексируется.Параметры.Индексируется = Выборка.Индексируется;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		ТабДокумент.Присоединить(ОбластьСтрокаУчетНачислений);
		ТабДокумент.Присоединить(ОбластьСтрокаИндексируется);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции



Функция ПечатнаяФормаБазаСтраховыхВзносов(Макет,ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписокНачислений";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	
	ДанныеДляПечати = РасчетнаяБазаСтраховыхВзносов();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru='Расчетная база ЕСВ';uk='Розрахункова база ЄСВ'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	
	Выборка = ДанныеДляПечати.ОблагаетсяЦеликом.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции


Функция ПечатнаяФормаСоставФОТ(Макет, ЗаголовокСписка, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СоставФОТ";
	ТабДокумент.Защита = Ложь;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаВидРасчета = Макет.ПолучитьОбласть("Шапка|ВидРасчета");
	ОбластьСтрокаВидРасчета = Макет.ПолучитьОбласть("СтрокаТаблицы|ВидРасчета");
	
	ДанныеДляПечати = СоставФОТ();
	
	ОбластьЗаголовок.Параметры.ЗаголовокСписка = НСтр("ru='Состав ФОТ';uk='Склад ФОП'");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	ТабДокумент.Вывести(ОбластьШапкаВидРасчета);
	
	Выборка = ДанныеДляПечати.ВходятВФОТ.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ОбластьСтрокаВидРасчета.Параметры.ВидРасчета = Выборка.ВидРасчетаНаименование;
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, ОбластьСтрокаВидРасчета) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьСтрокаВидРасчета);
		
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Выборка.ВидРасчета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ОблагаемаяБазаНДФЛ() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.КодДоходаНДФЛ КАК КодДоходаНДФЛ,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование,
	               |	Начисления.КодДоходаНДФЛ.Код КАК КодДоходаНДФЛСтрока
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаНДФЛ <> ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка) КАК КодДоходаНДФЛ,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.КодДоходаНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	БазаНДФЛ = Новый Структура;
	БазаНДФЛ.Вставить("ОблагаетсяНДФЛ", РезультатыЗапроса[0]);
	БазаНДФЛ.Вставить("НеОблагаетсяНДФЛ", РезультатыЗапроса[1]);
	
	Возврат БазаНДФЛ;
	
КонецФункции	

Функция СоставСреднегоЗаработкаОбщего() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НачисленияСреднийЗаработокОбщий.Ссылка КАК ВидРасчета,
	               |	НачисленияСреднийЗаработокОбщий.Значение КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	НачисленияСреднийЗаработокОбщий.Индексируется КАК Индексируется
	               |ПОМЕСТИТЬ ВТСреднийЗаработокОбщий
	               |ИЗ
	               |	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
	               |ГДЕ
	               |	НачисленияСреднийЗаработокОбщий.Значение <> ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать)
	               |	И НачисленияСреднийЗаработокОбщий.ПорядокРасчета = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление2010)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТСреднийЗаработокОбщий.ВидРасчета КАК ВидРасчета,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	               |	ВТСреднийЗаработокОбщий.УчетНачисленийВСреднемЗаработкеОбщий КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	ВТСреднийЗаработокОбщий.Индексируется КАК Индексируется,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	ВТСреднийЗаработокОбщий.ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ВТСреднийЗаработокОбщий КАК ВТСреднийЗаработокОбщий
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	ЗНАЧЕНИЕ(Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок) КАК УчетНачисленийВСреднемЗаработкеОбщий,
	               |	ЛОЖЬ КАК Индексируется,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	НЕ Начисления.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТСреднийЗаработокОбщий.ВидРасчета
	               |				ИЗ
	               |					ВТСреднийЗаработокОбщий КАК ВТСреднийЗаработокОбщий)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();			   
	
	БазаСреднегоЗаработкаОбщего = Новый Структура;
	БазаСреднегоЗаработкаОбщего.Вставить("ВходитВСоставСреднегоЗаработка", РезультатыЗапроса[1]);
	БазаСреднегоЗаработкаОбщего.Вставить("НеВходитВСоставСреднегоЗаработка", РезультатыЗапроса[2]);
	
	Возврат БазаСреднегоЗаработкаОбщего;
	
КонецФункции


Функция РасчетнаяБазаСтраховыхВзносов() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.ВидЕСВ КАК ВидЕСВ,
	               |	ИСТИНА КАК ТолькоПросмотр
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НеУчитывается)
				   |	И Начисления.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПустаяССылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.ВидЕСВ КАК ВидЕСВ,
	               |	ИСТИНА КАК ТолькоПросмотр
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НеУчитывается)
				   |	ИЛИ Начисления.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПустаяССылка)
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	БазаСтраховыхВзносов = Новый Структура;
	БазаСтраховыхВзносов.Вставить("ОблагаетсяЦеликом", РезультатыЗапроса[0]);
	БазаСтраховыхВзносов.Вставить("НеОблагается", РезультатыЗапроса[1]);
	
	Возврат БазаСтраховыхВзносов;
	
КонецФункции

Функция СоставФОТ() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.СпособВыполненияНачисления В(&СпособВыполненияНачисления)
	               |	И Начисления.ВключатьВФОТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.Ссылка КАК ВидРасчета,
	               |	Начисления.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	               |	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
	               |	Начисления.Наименование КАК ВидРасчетаНаименование
	               |ИЗ
	               |	ПланВидовРасчета.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.СпособВыполненияНачисления В(&СпособВыполненияНачисления)
	               |	И НЕ Начисления.ВключатьВФОТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
				   
	СпособыВыполненияНачисления = Новый Массив;
	СпособыВыполненияНачисления.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыполненияНачислений.ЕжемесячноПриОкончательномРасчете"));
	СпособыВыполненияНачисления.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыполненияНачислений.ВЗаданныхМесяцахПриОкончательномРасчете"));
	Запрос.УстановитьПараметр("СпособВыполненияНачисления", СпособыВыполненияНачисления);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	СоставФОТ = Новый Структура;
	СоставФОТ.Вставить("ВходятВФОТ", РезультатыЗапроса[0]);
	СоставФОТ.Вставить("НеВходятВФОТ", РезультатыЗапроса[1]);
	
	Возврат СоставФОТ;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли
